app/views/shared/_smoke_break.html.erb

	$(function () {
		$('#smoke-break-chart').highcharts({
			colors: ['#0F2668', '#C15C43', '#2D4FB5', '#f7a35c', '#8085e9', '#f15c80', '#e4d354', '#2b908f', '#f45b5b', '#91e8e1'],
			chart: {
				type: 'area'
			 },
		    title: { text: 'Consumptions' },
		    xAxis: { type: 'datetime' },
		    yAxis: {
		      title: { text: 'Smokes'}
		    },
		    series: [{
				pointInterval: <%= 1.day * 1000 %>,
				pointStart: <%= 2.weeks.ago.in_time_zone("Pacific Time (US & Canada)").at_midnight.to_i * 1000 %>,
				name: "Smokes",
				data: <%= (2.weeks.ago.in_time_zone("Pacific Time (US & Canada)").to_datetime..Time.now.in_time_zone("Pacific Time (US & Canada)").to_datetime).map { |date| current_user.smoke_breaks.total_on(date)}.inspect %>
		    },
			{
				pointInterval: <%= 1.day * 1000 %>,
				pointStart: <%= 2.weeks.ago.in_time_zone("Pacific Time (US & Canada)").at_midnight.to_i * 1000 %>,
				name: "Coffees",
				data: <%= (2.weeks.ago.in_time_zone("Pacific Time (US & Canada)").to_datetime..Time.now.in_time_zone("Pacific Time (US & Canada)").to_datetime).map { |date| current_user.coffee_intakes.total_on(date)}.inspect %>
		    },
				{
					pointInterval: <%= 1.day * 1000%>,
					pointStart: <%= 2.weeks.ago.in_time_zone("Pacific Time (US & Canada)").at_midnight.to_i * 1000 %>,
					name: "Drinks",
					data: <%= (2.weeks.ago.in_time_zone("Pacific Time (US & Canada)").to_datetime..Time.now.in_time_zone("Pacific Time (US & Canada)").to_datetime).map { |date| current_user.drink_intakes.total_on(date)}.inspect %>
			    }]
---
SELECT `coffee_intakes`.* FROM `coffee_intakes` WHERE `coffee_intakes`.`user_id` = 1 AND (recorded_time > '2015-08-12 07:00:00' AND recorded_time < '2015-08-13 07:00:00')
SELECT `drink_intakes`.* FROM `drink_intakes` WHERE `drink_intakes`.`user_id` = 1 AND (recorded_time > '2015-08-12 07:00:00' AND recorded_time < '2015-08-13 07:00:00')