app/controllers/landings_controller.rb

SELECT COUNT(*) AS count_all, DATE_ADD(CONVERT_TZ(DATE_FORMAT(CONVERT_TZ(DATE_SUB(created_at, INTERVAL 0 HOUR), '+00:00', 'America/Los_Angeles'), '%Y-%m-%d %H:00:00'), 'America/Los_Angeles', '+00:00'), INTERVAL 0 HOUR) AS hour FROM `smoke_breaks` WHERE (created_at >= '2015-08-13 00:00:00' AND created_at <= '2015-08-27 02:00:31') GROUP BY DATE_ADD(CONVERT_TZ(DATE_FORMAT(CONVERT_TZ(DATE_SUB(created_at, INTERVAL 0 HOUR), '+00:00', 'America/Los_Angeles'), '%Y-%m-%d %H:00:00'), 'America/Los_Angeles', '+00:00'), INTERVAL 0 HOUR)
SELECT COUNT(*) AS count_all, DATE_ADD(CONVERT_TZ(DATE_FORMAT(CONVERT_TZ(DATE_SUB(created_at, INTERVAL 0 HOUR), '+00:00', 'America/Los_Angeles'), '%Y-%m-%d %H:00:00'), 'America/Los_Angeles', '+00:00'), INTERVAL 0 HOUR) AS hour FROM `drink_intakes` WHERE (created_at >= '2015-08-13 00:00:00' AND created_at <= '2015-08-27 02:00:31') GROUP BY DATE_ADD(CONVERT_TZ(DATE_FORMAT(CONVERT_TZ(DATE_SUB(created_at, INTERVAL 0 HOUR), '+00:00', 'America/Los_Angeles'), '%Y-%m-%d %H:00:00'), 'America/Los_Angeles', '+00:00'), INTERVAL 0 HOUR)
SELECT COUNT(*) AS count_all, DATE_ADD(CONVERT_TZ(DATE_FORMAT(CONVERT_TZ(DATE_SUB(created_at, INTERVAL 0 HOUR), '+00:00', 'America/Los_Angeles'), '%Y-%m-%d %H:00:00'), 'America/Los_Angeles', '+00:00'), INTERVAL 0 HOUR) AS hour FROM `coffee_intakes` WHERE (created_at >= '2015-08-13 00:00:00' AND created_at <= '2015-08-27 02:00:32') GROUP BY DATE_ADD(CONVERT_TZ(DATE_FORMAT(CONVERT_TZ(DATE_SUB(created_at, INTERVAL 0 HOUR), '+00:00', 'America/Los_Angeles'), '%Y-%m-%d %H:00:00'), 'America/Los_Angeles', '+00:00'), INTERVAL 0 HOUR)
---
  def index
    @smoke_break_chart = current_user.smoke_breaks
    @drink_break_chart = current_user.drink_intakes
    @coffee_break_chart = current_user.coffee_intakes
    @last_five_smoke_breaks = current_user.smoke_breaks.last(5).reverse
    @last_five_coffee_breaks = current_user.coffee_intakes.last(5).reverse
    @last_five_drinks = current_user.drink_intakes.last(5).reverse

		@time = 1.weeks.ago.midnight
	  @smoke_break_array = []
		@smoke_break_group = SmokeBreak.group_by_hour(:created_at, time_zone: "Pacific Time (US & Canada)", range: @time..Time.now).count
		@smoke_break_group.map { |k, v| @smoke_break_array.push(v)}
    @smoke_breaks_hash = { :time => @time, :smoke_array => @smoke_break_array }

	  @drink_intake_array = []
		@drink_intake_group = DrinkIntake.group_by_hour(:created_at, time_zone: "Pacific Time (US & Canada)", range: @time..Time.now).count
		@drink_intake_group.map { |k, v| @drink_intake_array.push(v)}
    @drink_intake_hash = { :time => @time, :drink_array => @drink_intake_array }

	  @coffee_intake_array = []
		@coffee_intake_group = CoffeeIntake.group_by_hour(:created_at, time_zone: "Pacific Time (US & Canada)", range: @time..Time.now).count